УТ_для_edt/src/DataProcessors/смартРаботаСОборудованиемИЧерниламиКлиентов/смартРаботаСОборудованиемИЧерниламиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартРаботаСОборудованиемИЧерниламиКлиентов</name>
  <comment>//++ #1305 смарт: Фролов 07.02.2023 //Отчет Стоимость использования оборудования</comment>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/смартОборудованиеЧернилаКлиентов/смартОборудованиеЧернилаКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОборудованиеЧернилаКлиентов</name>
  <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
  <resources>
    <name>Количество</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МотоРесурс</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АвторИзменения</name>
    <comment>#1741 смарт: Лопато 03.04.2024 //Доработать регистр сопоставления оборудования клиентов</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>#1741 смарт: Лопато 03.04.2024 //Доработать регистр сопоставления оборудования клиентов</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОборудованиеКлиентов</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СопоставлениеСТоваром</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/DataProcessors/смартРаботаСОборудованиемИЧерниламиКлиентов/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьПоГруппеНоменклатурыНаСервере()
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	смартОборудованиеЧернилаКлиентов.Номенклатура КАК Номенклатура,
	                    |	смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов КАК ОборудованиеКлиента,
	                    |	смартОборудованиеЧернилаКлиентов.Количество КАК Количество,
	                    |	смартОборудованиеЧернилаКлиентов.МотоРесурс КАК МотоРесурс,
	                    |	смартОборудованиеЧернилаКлиентов.СопоставлениеСТоваром КАК СопоставлениеСТоваром
	                    |ИЗ
	                    |	РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                    |	Номенклатура.Ссылка КАК Номенклатура
	                    |ИЗ
	                    |	Справочник.Номенклатура КАК Номенклатура
	                    |ГДЕ
	                    |	НЕ Номенклатура.ПометкаУдаления
	                    |	И НЕ Номенклатура.ЭтоГруппа
	                    |	И Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)"); 
	Запрос.УстановитьПараметр("ГруппаНоменклатуры",ЭтаФорма.ГруппаНоменклатуры);
	МасРез=Запрос.ВыполнитьПакет();
	ЭтаФорма.ЗаполнениеДанных.Загрузить(МасРез[0].Выгрузить()); 
	ЭтаФорма.СпсНоменклатуры.Загрузить(МасРез[1].Выгрузить());	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеНоменклатуры(Команда)
	ЗаполнитьПоГруппеНоменклатурыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(СохраняемОборудование=Ложь)
	УстановитьПривилегированныйРежим(Истина);
	НЗ=РегистрыСведений.смартОборудованиеЧернилаКлиентов.СоздатьНаборЗаписей();
	НЗ.Отбор.Номенклатура.Установить(ЭтаФорма.ТекущаяНоменклатура);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
	Если СохраняемОборудование ТОгда
		СтрокиЗаполнениеДанных=ЭтаФорма.ЗаполнениеДанных.НайтиСтроки(Новый Структура("Номенклатура",ЭтаФорма.ТекущаяНоменклатура));
	Иначе
		СтрокиЗаполнениеДанных=ЭтаФорма.ЗаполнениеДанныхОборудование.НайтиСтроки(Новый Структура("ОборудованиеКлиента",ЭтаФорма.ТекущееОборудование));
	КонецЕсли;
	Для Каждого Стр Из СтрокиЗаполнениеДанных Цикл 
		Если ЗначениеЗаполнено(Стр.ОборудованиеКлиента) И ((Стр.Количество И Стр.МотоРесурс) ИЛИ Стр.СопоставлениеСТоваром) Тогда
			СтрМЗ=РегистрыСведений.смартОборудованиеЧернилаКлиентов.СоздатьМенеджерЗаписи();
			СтрМЗ.ОборудованиеКлиентов=Стр.ОборудованиеКлиента;
			СтрМЗ.Номенклатура=Стр.Номенклатура;
			СтрМЗ.Количество=Стр.Количество;
			СтрМЗ.МотоРесурс=Стр.МотоРесурс;
			СтрМЗ.СопоставлениеСТоваром=Стр.СопоставлениеСТоваром;
			СтрМЗ.Записать();  
		КонецЕсли;
	КонецЦикла; 
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СпсНоменклатурыПриАктивизацииСтроки(Элемент)
	Если НЕ Элемент.ТекущиеДанные=Неопределено ТОгда
		Если ЭтаФорма.АвтоматическиСохранять Тогда
			СохранитьНаСервере(Истина);	
		КонецЕсли;	
		Элементы.ЗаполнениеДанных.ОтборСтрок=Новый ФиксированнаяСтруктура("Номенклатура",Элемент.ТекущиеДанные.Номенклатура);
		ЭтаФорма.ТекущаяНоменклатура=Элемент.ТекущиеДанные.Номенклатура; 
	Иначе	
		Элементы.ЗаполнениеДанных.ОтборСтрок=Новый ФиксированнаяСтруктура("Номенклатура",Неопределено);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеДанныхПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока ТОгда
		Элемент.ТекущиеДанные.Номенклатура=ЭтаФорма.ТекущаяНоменклатура;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораОборудования(Значение, ДопПараметры) Экспорт
	Если НЕ Значение=Неопределено Тогда
		Для Каждого Стр Из Значение Цикл
			СтрокаОборудование=ЗаполнениеДанных.Добавить();
			СтрокаОборудование.Номенклатура=ЭтаФорма.ТекущаяНоменклатура;
			СтрокаОборудование.ОборудованиеКлиента=Стр;
		КонецЦикла;	                       
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНоменклатурыПриИзменении(Элемент)
	ЗаполнитьПоГруппеНоменклатурыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстанновитьЗначенияКакУТекущейСтроки(Команда)
	Количество=ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Количество;
	Моторесурс=ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Моторесурс;
	СтрокиЗаполнениеДанных=ЗаполнениеДанных.НайтиСтроки(Новый Структура("Номенклатура",ЭтаФорма.ТекущаяНоменклатура));	
	Для Каждого СтрЗаполнениеДанных Из СтрокиЗаполнениеДанных Цикл
		Если СтрЗаполнениеДанных.Количество=0 Или СтрЗаполнениеДанных.Моторесурс=0 Тогда
			СтрЗаполнениеДанных.Количество=Количество;
			СтрЗаполнениеДанных.Моторесурс=Моторесурс;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНесколько(Команда)
	ПараметрыПодбора = Новый Структура;    
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыПодбора.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);  
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораОборудования", ЭтаФорма);
	ОткрытьФорму("Справочник.смартОборудованиеКлиентов.ФормаВыбора", ПараметрыПодбора,ЭтаФорма,,,,ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеМоторесурсаСопоставлениеСТоваромПриИзменении(Элемент)
	Если Элемент.Родитель.ТекущиеДанные.СопоставлениеСТоваром Тогда
		Элемент.Родитель.ТекущиеДанные.Количество=0;
		Элемент.Родитель.ТекущиеДанные.Моторесурс=0; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеМоторесурсаМоторесурсПриИзменении(Элемент)
	Если Элемент.Родитель.ТекущиеДанные.Моторесурс>0 Тогда
		Элемент.Родитель.ТекущиеДанные.СопоставлениеСТоваром=Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеМоторесурсаКоличествоПриИзменении(Элемент)
	Если Элемент.Родитель.ТекущиеДанные.Количество>0 Тогда
		Элемент.Родитель.ТекущиеДанные.СопоставлениеСТоваром=Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыбранные(Команда)
	ПараметрыВыбора = Новый Структура;    
	ПараметрыВыбора.Вставить("ТаблицаЗаполнения", "ЗаполнениеДанных");
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормаВводаДанных", ЭтаФорма);
	ОткрытьФорму("Обработка.смартРаботаСОборудованиемИЧерниламиКлиентов.Форма.ФормаВводаДанных",ПараметрыВыбора,ЭтаФорма,,,,ОбработкаВыбора);
КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытииФормаВводаДанных(Значение, ДопПараметры) Экспорт
	Если ТипЗнч(Значение)=Тип("Структура") Тогда
		Если Значение.ТаблицаЗаполнения="ЗаполнениеДанных" Тогда
			Для Каждого Стр Из Элементы.ЗаполнениеДанных.ВыделенныеСтроки Цикл
				ЗаполнениеДанных[Стр].Моторесурс=?(ЗаполнениеДанных[Стр].СопоставлениеСТоваром,0,Значение.Моторесурс);	
				ЗаполнениеДанных[Стр].Количество=?(ЗаполнениеДанных[Стр].СопоставлениеСТоваром,0,Значение.Количество);	
			КонецЦикла;	
		Иначе
			Для Каждого Стр Из Элементы.ЗаполнениеДанныхОборудование.ВыделенныеСтроки Цикл
				ЗаполнениеДанныхОборудование[Стр].Моторесурс=?(ЗаполнениеДанныхОборудование[Стр].СопоставлениеСТоваром,0,Значение.Моторесурс);	
				ЗаполнениеДанныхОборудование[Стр].Количество=?(ЗаполнениеДанныхОборудование[Стр].СопоставлениеСТоваром,0,Значение.Количество);	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ГруппаОборудованияПриИзмененииНаСервере()
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	смартОборудованиеЧернилаКлиентов.Номенклатура КАК Номенклатура,
	                    |	смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов КАК ОборудованиеКлиента,
	                    |	смартОборудованиеЧернилаКлиентов.Количество КАК Количество,
	                    |	смартОборудованиеЧернилаКлиентов.МотоРесурс КАК МотоРесурс,
	                    |	смартОборудованиеЧернилаКлиентов.СопоставлениеСТоваром КАК СопоставлениеСТоваром
	                    |ИЗ
	                    |	РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                    |	смартОборудованиеКлиентов.Ссылка КАК ОборудованиеКлиента
	                    |ИЗ
	                    |	Справочник.смартОборудованиеКлиентов КАК смартОборудованиеКлиентов
	                    |ГДЕ
	                    |	НЕ смартОборудованиеКлиентов.ПометкаУдаления
	                    |	И НЕ смартОборудованиеКлиентов.ЭтоГруппа
	                    |	И смартОборудованиеКлиентов.Ссылка В ИЕРАРХИИ(&ГруппаОборудования)"); 
	Запрос.УстановитьПараметр("ГруппаОборудования",ЭтаФорма.ГруппаОборудования);
	МасРез=Запрос.ВыполнитьПакет();
	ЭтаФорма.ЗаполнениеДанныхОборудование.Загрузить(МасРез[0].Выгрузить()); 
	ЭтаФорма.СпсОборудования.Загрузить(МасРез[1].Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОборудованияПриИзменении(Элемент)
	ГруппаОборудованияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СпсОборудованияПриАктивизацииСтроки(Элемент)
	Если НЕ Элемент.ТекущиеДанные=Неопределено ТОгда
		Если ЭтаФорма.АвтоматическиСохранятьОборудование Тогда
			СохранитьНаСервере(Ложь);	
		КонецЕсли;	
		Элементы.ЗаполнениеДанныхОборудование.ОтборСтрок=Новый ФиксированнаяСтруктура("ОборудованиеКлиента",Элемент.ТекущиеДанные.ОборудованиеКлиента);
		ЭтаФорма.ТекущееОборудование=Элемент.ТекущиеДанные.ОборудованиеКлиента; 
	Иначе	
		Элементы.ЗаполнениеДанныхОборудование.ОтборСтрок=Новый ФиксированнаяСтруктура("ОборудованиеКлиента",Неопределено);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОборудование(Команда)
	ПараметрыПодбора = Новый Структура;    
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыПодбора.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);  
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораНоменклатуры", ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.смартФормаВыбораМножественный", ПараметрыПодбора,ЭтаФорма,,,,ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораНоменклатуры(Значение, ДопПараметры) Экспорт
	Если НЕ Значение=Неопределено Тогда
		Для Каждого Стр Из Значение Цикл
			СтрокаОборудование=ЗаполнениеДанныхОборудование.Добавить();
			СтрокаОборудование.ОборудованиеКлиента=ЭтаФорма.ТекущееОборудование;
			СтрокаОборудование.Номенклатура=Стр;
		КонецЦикла;	                       
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыбранныеОборудование(Команда)
	ПараметрыВыбора = Новый Структура;    
	ПараметрыВыбора.Вставить("ТаблицаЗаполнения", "ЗаполнениеДанныхОборудование");
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормаВводаДанных", ЭтаФорма);
	ОткрытьФорму("Обработка.смартРаботаСОборудованиемИЧерниламиКлиентов.Форма.ФормаВводаДанных",ПараметрыВыбора,ЭтаФорма,,,,ОбработкаВыбора);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОборудование(Команда)
	СохранитьНаСервере(Ложь);
КонецПроцедуры
